{
    "page_1": "26 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes disclosure is not applicable for modified fixed- rate and step-rate loans. L-108 Alternative Delinquency Resolution Loss mitigation solution that resolves delinquencies and helps homeowners remain in their homes in accordance with the servicer contractual obligation, while allowing the loan to remain in the security. Payment Deferral - For borrowers who have resolved temporary hardship and can resume making their monthly mortgage payment but cannot afford either full reinstatement or repayment plan to bring the loan current. At least two and up to six months of past due principal and interest I payments can be deferred, as well as out-of-pocket escrow advances paid to third parties, and servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The borrower may not defer more than 12 months of cumulative past- due I payments over the life of the loan. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity, or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or String 1 Applicable for monthly disclosure only. Effective beginning with the December 2020 factor date. Discloses the latest ADR plan completed by the borrower. Not applicable - Loan never had payment deferral. Updates to the standard Payment Deferral were effective for implementation starting July 1, 2023, with mandatory implementation by October 1, 2023. Previously, the borrower could defer only up to two months of missed principal and interest I payments.",
    "page_2": "27 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes payoff of the interest-bearing UPB. COVID-19 Payment Deferral - For borrowers who experienced COVID-19 related hardship and can resume making their monthly mortgage payment. Up to 18 months of missed I payments can be deferred, as well as out-of- pocket escrow advances paid to third parties servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or payoff of the interest-bearing UPB. Disaster Payment Deferral - For borrowers who experienced disaster related hardship and can resume making their monthly mortgage payment. Up to 12 months of missed I payments can be deferred, as",
    "page_3": "28 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Loan Level File ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Implementation Notes well as out-of- pocket escrow advances paid to third parties servicing advances paid to third parties in the ordinary course of business and not retained by the servicer, if allowed by state law. The amount is deferred into non-interest- bearing balance due at mortgage loan maturity or earlier upon the sale or transfer of the property, refinance of the mortgage loan, or payoff of the interest-bearing UPB. Other - The borrower has executed an Alternative Delinquency Resolution program other than the other provided enumerations. Not Applicable 7 An Alternative Delinquency Resolution is not applicable for the related mortgage loan. Not Available 9 The Alternative Delinquency Resolution is not available for disclosure."
}