{
    "page_1": "43 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-86 WA Origination Credit Score For reperforming, modified fixed-rate and modified step-rate loans, the weighted average standardized credit score used to evaluate the borrower during the loan origination process. Numeric 4 If value 300 or 850, then the score is considered not available S-87 FILLER S-88 FILLER S-89 Origination Third Party Origination UPB Percent For reperforming, modified fixed-rate and modified step rate loans, the percentage of the aggregate Investor Loan UPB that was originated by third party, to include Broker and Correspondent originations. Numeric 3.2 6 S-90 WA Estimated Loan- To-Value ELTV For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average ratio obtained by dividing the outstanding balance of the mortgage loan by the estimated current value of the property obtained by the issuer, at the time of issuance. Numeric 3 If value 1 or 998, then the ratio is considered not available only applicable to securities issued on or after 9 1 2017 S-91 WA Updated Credit Score For reinstated, reperforming, modified fixed-rate and modified step-rate loans, the weighted average most recently available standardized credit score provided at the time of issuance. Numeric 4 If value 300 or 850, then the score is considered not available S-92 Mission Density Score The mission density score MDS is score representing the number of Mission Dimensions for which each mortgage loan qualifies. See the Mission Index Guide for additional definition information and for calculations. Attribute previously named Social Density Score SDS . 7.77 - Not Applicable 9.99 Not Available Numeric 1.2 4 Pools issued prior to 1 1 2010 default to 9.99 The maximum score will be 2.5 to minimize privacy concerns in cases where all 3 criteria are met The pool must have 10 loans that are either primary home or investment property at the time of issuance to generate an MDS score, otherwise default to 7.77 S-93 Mission Criteria Share The mission criteria share MCS is the percentage of loans in security that satisfies at least one Mission Dimension. 777.77 - Not Applicable 999.99 Not Available Numeric 3.2 6 Pools issued prior to 1 1 2010 default to 999.99",
    "page_2": "44 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes See the Mission Index Guide for additional definition information and for calculations. Attribute previously named Social Criteria Share SCS . The pool must have 10 loans that are either primary home or investment property at the time of issuance to generate an MCS score, otherwise default to 777.77 S-94 Green Indicator The indicator denoting whether the security is labeled Green MBS secured by loans that are eligible per Freddie Mac Green Bond Framework. Yes No String 1 The L1 pool must have 100 green eligible loans. S-95 Social Indicator The indicator denoting whether the security is labeled Social MBS secured by loans that are eligible per Freddie Mac Social Bond Framework. Yes No 9 Not Available String 1 Disclosure is effective beginning with pools issued as of June 2024. The L1 or L2 ML pool must have an MCS 100 and MDS 2.0. If the pool disclosure is in preliminary status, then the Indicator will be set to 9 Not Available. S-96 Mission Index Version The version of the Mission Index methodology used to calculate the Mission Criteria Share and the Mission Density Score. V1.0 Version 1.0 V1.1 Version 1.1 555 Mixed 777 Not Applicable String 5 Not Applicable 777 Securities issued prior to 1 2010, Reinstated or Modified securities V1.0 - Level 1 securities issued 1 2010 to 5 2024 V1.1 - Level 1 securities issued beginning 6 2024"
}