{
    "page_1": "32 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files The daily security level issuance file contains security level data including the pool factor and weighted averages for the mortgage- backed securities, including single-class resecuritizations. Information is provided as of the time of the issuance of the security. The monthly security level file has the same file layout. The monthly security level file provides updated information calculated based on the mortgage information reported to Freddie Mac by servicers. The same mortgage information is used by Freddie Mac to calculate monthly pool factors for the month in which the disclosure is provided. This data should be considered in conjunction with the information appearing in the applicable Freddie Mac Offering Circulars, as supplemented. The security data file includes the attribute names, definitions, enumerations, data types, formats, max lengths and implementation notes. In the case of single-class resecuritizations, information on the collateral backing the single-class securitization will be provided. Freddie Mac will publish three daily security files each business day in the morning and three monthly security level files. Most of Freddie Mac securities will be in one file, but we will publish second security file with the data for the following securities Adjustable-Rate Mortgages ARM , Modified, Reinstated 75-Day payment delay Fixed-Rate PC securities. ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-01 Prefix The designation assigned by the issuer denoting the type of the loans and the security. String 3 S-02 Security Identifier The unique designation assigned to the security by the issuer. String 6 S-03 CUSIP The unique designation assigned to the security by the Committee on Uniform Securities Identification Procedures CUSIP . String 9 S-04 Security Factor Date The month and year on which the corresponding factor is effective. Date MMCCYY 6 S-05 Security Factor The decimal value that, when multiplied by the Issuance Investor Security UPB amount, equals the Current Investor Security UPB amount. Numeric 1.8 10 Rounded to the 8th decimal For 55-Day Mirror Exchanges, the Security Factor will be 1 in the Daily Issuance files. S-06 Payment Delay Days The indicator used to denote that the loans in the security participate in 45 Day, 55 Day, or 75 Day payment delay period at the time the security was issued. 45 45 Days 55 55 Days 75 75 Days Numeric 2 S-07 Security Data Correction Indicator The indicator used to denote the data correction status of the security based on the current reporting period. Yes No String 1 Applicable at Issuance Monthly Disclosure S-08 Security Status Indicator The indicator used to denote the status of the security based on the current reporting period. Active Paid Off Collapsed Dissolved String 1 S-09 Security Notification Indicator The indicator used to denote whether the disclosure is preliminary and subject to change or final. Preliminary Final 7 Not Applicable String 1 Applicable at Issuance Monthly Disclosure",
    "page_2": "33 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-10 Security Description The unique designation of the security including abbreviated FED CODE, WA Net Interest Rate, Prefix and Security Identifier. String 22 Security Description The unique designation of the security including abbreviated FED CODE, WA Net Interest Rate, Prefix and Security Identifier. String 23 For Pseudopools only S-11 Issuer The name of the entity that issued the security. FNM Fannie Mae FRE Freddie Mac String 3 S-12 Issue Date The date on which the security was issued. Date MMDDCC YY 8 Day value will be defaulted to 01 S-13 Maturity Date The month and year in which the final payment on the security is scheduled to be made at the time the security was issued. Date MMCCYY 6 S-14 Updated Longest Maturity Date The updated month and year in which the final payment on the security is scheduled to be made based on the longest maturity date of the remaining loans in the security. Date MMCCYY 6 Updated monthly, based on the longest loan level maturity date S-15 Issuance Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the balance of the security at the time the security was issued. Numeric 14.2 17 Truncated to whole number S-16 Current Investor Security UPB The aggregate unpaid principal balance of the loans as they contribute to the current balance of the security. Numeric 14.2 17 For 55-Day Mirror Exchanges, at issuance, the Current Investor Security UPB will be set to the current UPB of the underlying 45-day PC. S-17 WA Net Interest Rate The weighted average interest rate of the loans less servicing fees and guarantor fees. Numeric 2.3 6 Rounded to the 3rd decimal WA Net Interest Rate The weighted average interest rate of the loans less servicing fees and guarantor fees. Numeric 2.5 8 Rounded to the 5th decimal For Pseudopools only S-18 WA Issuance Interest Rate The weighted average interest rate of the loans in effect at the time the security was issued. Numeric 2.3 6 Rounded to the 3rd decimal S-19 WA Current Interest Rate The weighted average interest rate of the loans Numeric 2.3 6 Rounded to the 3rd decimal Not applicable for Freddie Mac ARM",
    "page_3": "34 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes in effect during the current reporting period. For 55-Day Mirror Exchanges, at issuance, the WA Current Interest Rate will be set to the WA Current Interest Rate of the underlying 45- day PC. S-20 WA Net Accrual Interest Rate For adjustable-rate loans, the weighted average Interest Rate less servicing fees and guarantor fees. Numeric 2.3 6 Rounded to the 3rd decimal Not applicable for Freddie Mac ARMs S-21 WA Loan Term The weighted average number of months in which regularly scheduled borrower payments are due. Numeric 3 S-22 WA Issuance Remaining Months to Maturity The weighted average number of scheduled monthly payments that will reduce the Investor Loan UPB to zero, at the time the security was issued. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 S-23 WA Current Remaining Months to Maturity The weighted average number of scheduled monthly payments that will reduce the Current Investor Loan UPB to zero. For fixed-rate loans, this value takes into account the impact of any curtailments. Numeric 3 For 55-Day Mirror Exchanges, at issuance, the WA Current RMM will be set to the WA Current RMM of the underlying 45-day PC. Value can be negative S-24 WA Loan Age The weighted average number of scheduled payments from the time the loans were originated or modified up to and including the current reporting period. Numeric 3 Rounded to nearest integer Value can be negative S-25 WA Mortgage Loan Amount The weighted average dollar amount of the loans as stated on the notes at the time the loans were originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal",
    "page_4": "35 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-26 Average Mortgage Loan Amount The simple average dollar amount of the loans as stated on the notes at the time the loans were originated or modified. For reperforming, modified fixed-rate and modified step-rate loans, this value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal S-27 WA Loan-To-Value LTV The weighted average ratio, expressed as percentage, obtained by dividing the amount of the loans at origination by the value of the properties. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-28 WA Combined Loan- To-Value CLTV The weighted average ratio, expressed as percentage, obtained by dividing the amount of all known outstanding loans at origination by the value of the properties. Property value reflects either the lesser of the sales price or the appraised property value for purchase, or the appraised property value for refinance. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 998, then the ratio is considered not available securities issued on or after 9 1 2017 S-29 WA Debt-To-Income DTI The weighted average ratio obtained by dividing the total monthly debt expenses by the total monthly incomes of the borrowers at the time the loans were originated or modified. 999 Not Available Numeric 3 Rounded to the nearest integer If value 1 or 65, then the ratio is considered not available",
    "page_5": "36 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-30 WA Borrower Credit Score The weighted average standardized credit score used to evaluate the borrower during the loan origination process. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. 9999 Not Available Numeric 4 Rounded to the nearest integer If value 300 or 850, then the score is considered not available S-31 FILLER S-32 FILLER S-33 Loan Count The total number of loans in the security. Numeric 9 S-34 Third Party Origination UPB Percent The percentage of the aggregate Investor Loan UPB that were originated by third party, to include Broker and Correspondent originations. For reperforming, modified fixed-rate and modified step-rate loans, this value will be blank. Numeric 3.2 6 Rounded to the 2nd decimal S-35 Seller Name The name of the entity that sold the loans to the issuer. String 100 For Multilenders this field will be MULTIPLE For Giants, this field will be SCR Single-Class Resecuritization For 55-day Mirror Exchanges, this field will be SCR- MIRROR Field will not be updated after issuance, for mergers and acquisitions S-36 Seller City The city of the address of the entity that sold the loans to the issuer. String 50 For Multilenders and Giants, this field will be blank. S-37 Seller State The state or territory of the address of the entity that sold the loans to the issuer. String 2 For Multilenders and Giants this field will be blank.",
    "page_6": "37 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-38 Servicer Name The name of the entity that services the loan during the current reporting period. String 100 For Multilenders this field will be MULTIPLE For Giants, this field will be SCR Single-Class Resecuritization - For 55-day Mirror Exchanges, this field will reflect SCR-MIRROR Field will not be updated after issuance, regardless of mergers and acquisitions. S-39 Servicer City The city of the address of the entity that services the loan. String 50 For Multilenders and Giants, this field will be blank S-40 Servicer State The state or territory of the address of the entity that services the loan. String 2 For Multilenders and Giants this field will be blank S-41 Involuntary Loan Purchases Prior Month UPB Formerly Known As Delinquent Loans Purchased Prior Month UPB The aggregate prior period Investor Loan UPB of the loans that were removed from the security due to involuntary reasons during the current reporting period. Involuntary reasons include loan delinquencies, loss mitigation efforts and lender repurchases. Numeric 14.2 17 Monthly Security file only Effective June 2019 BD4 Attribute label will be updated after June 2019 S-42 Involuntary Loan Purchases Loan Count Formerly Known As Delinquent Loans Purchased Loan Count The number of loans that were removed from the security due to involuntary reasons during the current reporting period. Involuntary reasons include loan delinquencies, loss mitigation efforts and lender repurchases. Numeric 9 Monthly Security file only Effective June 2019 BD4 Attribute label will be updated after June 2019 S-43 Eligible for Resecuritization The indicator used to denote that the security is eligible for resecuritization. Yes No String 1 S-44 Notes Additional information about the loans in the security. String 2048 S-45 Notes Ongoing Additional information about the loans in the security. String 2048 Monthly Security file only S-46 Interest Only Security Indicator The indicator denoting whether the loans only require interest payments for specified period beginning with the first payment date. Yes No String 1",
    "page_7": "38 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-47 WA Months to Amortization For interest-only loans, the weighted average number of months from the current month to the first scheduled principal and interest payment date. Numeric 3 Rounded to nearest whole number If Interest Only Security Indicator S-48 Prepayment Penalty Indicator The indicator denoting whether the security is subject to penalty for early payment of principal. Yes No 5 Mixed 9 Not Available String 1 S-49 Reduced Minimum Servicing Indicator The indicator denoting whether the loans in the security may have reduced servicing fee. Yes No 9 Not Available String 1 S-50 Subtype For an adjustable-rate mortgage, the code that identifies ARM product characteristics and features. String 20 Not applicable for Freddie Mac ARMs S-51 Index For adjustable-rate loans, the description of the index on which adjustments to the interest rate are based. See Appendix String 3 As of 8 28 17, the Index description string will no longer be disclosed, only the index code see Appendix A. S-52 WA Mortgage Margin For adjustable-rate loans, the weighted average number of percentage points to be added to the index to arrive at the new interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal place Issuance value will be populated in the monthly files. S-53 WA MBS PC Margin For adjustable-rate loans, the weighted average mortgage margin less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal place If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation. S-54 Interest Rate Adjustment Frequency For adjustable-rate loans, the number of months, excluding any fixed-rate period, between scheduled rate changes. 55.555 Mixed Numeric 3 S-55 Interest Rate Lookback For adjustable-rate loans, the number of calendar days prior to the interest rate change date used to determine the effective index value required to calculate the next interest rate. 55.555 Mixed Numeric 3 S-56 Payment Adjustment Frequency For adjustable-rate loans, the number of months between scheduled payment changes. For security with an initial fixed-rate period, the payment adjustment frequency is the number of months between subsequent payment changes. 555 Mixed Numeric 3",
    "page_8": "39 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-57 Payment Lookback For negative amortizing adjustable-rate loans, the number of days prior to payment effective date used to determine value when calculating principal and interest payment. Numeric 3 S-58 Convertibility Indicator For adjustable-rate loans, the indicator denoting whether the loans in the security have feature that allows the borrower to convert from an adjustable rate to fixed rate. Yes No 9 Not Available String 1 S-59 Negative Amortization Indicator For adjustable-rate loans, the indicator used to denote that the loans in the security allow negative amortization. Yes No 9 Not Available String 1 S-60 Negative Amortization Factor For negative amortizing adjustable-rate loans, the decimal value that, when multiplied by the Issuance Investor Security UPB amount, equals the Negative Amortization amount. Numeric 1.8 10 Rounded to the 8th decimal place If Negative Amortization Indicator S-61 WA Negative Amortization Limit For negative amortizing adjustable-rate loans, the weighted average Negative Amortization Limit of the loans in the security. 99.999 Not Available Numeric 2.3 6 Not applicable to Freddie Mac ARMs S-62 Initial Fixed Rate Period For adjustable-rate loans, the number of calendar months between the first full month the loans accrue interest and the first interest rate change date. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months 55 Mixed String 2 S-63 First Rate Adjustment Date For adjustable-rate loans, the earliest First Rate Adjustment Date of the loans in the security. Date MMCCYY 6 Not applicable for Freddie Mac ARMs S-64 First Payment Adjustment Date For adjustable-rate loans, the earliest First Payment Adjustment Date of the loans in the security. Date MMCCYY 6 Not applicable for Freddie Mac ARMs",
    "page_9": "40 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-65 WA Months to Next Rate Adjustment Date For adjustable-rate loans, the weighted average number of months from the current month to the next interest rate change date. Numeric 3 Rounded to nearest whole number S-66 WA Life Interest Rate Ceiling For adjustable-rate loans, the weighted average lifetime maximum interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal Issuance value will be populated in the monthly files. If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-67 WA Net Life Interest Rate Ceiling For adjustable-rate loans, the weighted average maximum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal If all loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-68 WA Life Interest Rate Floor For adjustable-rate loans, the weighted average lifetime minimum interest rate. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal Issuance field, will be populated with 77.777 in monthly files. If any loan level values 77.777, then set to 77.777 else exclude from weighted average calculation S-69 WA Net Life Interest Rate Floor For adjustable-rate loans, the weighted average minimum interest rate less servicing fees and guarantor fees. 77.777 - Not Applicable Numeric 2.3 6 Rounded to the 3rd decimal If any loan level value 77.777, set value to 77.777 else exclude from weighted average calculation S-70 Initial Interest Rate Cap Up For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-71 Initial Interest Rate Cap Down For adjustable-rate loans, the maximum percentage points the interest rate can adjust downward at the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-72 Periodic Interest Rate Cap Up For adjustable-rate loans, the maximum percentage points the interest rate can adjust upward at each interest rate change date after the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6 S-73 Periodic Interest Rate Cap Down For adjustable-rate loans, the maximum percentage points the interest rate can adjust downward at each interest rate change date after the first interest rate change date. 55.555 Mixed 77.777 - Not Applicable Numeric 2.3 6",
    "page_10": "41 Version 4.0 Effective 09-23-2024 Date last updated 08-06-2024 Security Supplemental Files ID Attribute Name Attribute Definition Codes Enumerations Data Type Format Max Length Precision Implementation Notes S-74 Initial Step Fixed- Rate Period For reperforming, modified step-rate loans, the number of months between the first payment date of the modified loan and the first step rate adjustment. 00 6 Months 01 7-18 Months 02 19-30 Months 03 31-42 Months 04 43-54 Months 05 55-66 Months 06 67-78 Months 07 79-90 Months 08 91-102 Months 09 103-114 Months 10 115-126 Months 11 127-138 Months 12 139-150 Months 13 151-162 Months 14 163-174 Months 15 175-186 Months 16 186 Months 55 Mixed String 2 S-75 Step Rate Adjustment Frequency For reperforming, modified step-rate loans, the number of months between each interest rate adjustment. 555 Mixed Numeric 3 S-76 Next Step Rate Adjustment Date For reperforming, modified step-rate loans, the month and year that the interest rate is scheduled to increase. Date MMCCYY 6 S-77 WA Months to Next Step Rate Adjustment For reperforming, modified step-rate loans, the weighted average number of months from the current month to the next date on which the mortgage interest rate increases. Numeric 3 Rounded to whole number S-78 Periodic Step Rate Cap Up For reperforming, modified step-rate loans, the maximum percentage points the interest rate may increase at each step rate adjustment date. 55.555 Mixed Numeric 2.3 6 S-79 WA Origination Mortgage Loan Amount For reperforming, modified fixed-rate and modified step-rate loans, the weighted average dollar amount of the loans in the security as stated on the notes at the time the loans were originated. Numeric 9.2 12 Rounded to the 2nd decimal S-80 Average Origination Mortgage Loan Amount For reperforming, modified fixed-rate and modified step-rate loans, the simple average dollar amount of the loans in the security as stated on the notes at the time the loans were originated. This value represents both the interest bearing and non-interest bearing amount. Numeric 9.2 12 Rounded to the 2nd decimal"
}